# Влади е студент, живее в София и си ходи от време на време до родния град. Той
# е много запален по волейбола, но е зает през работните дни и играе волейбол
# само през уикендите и в празничните дни. Влади играе в София всяка събота,
# когато не е на работа и не си пътува до родния град, както и в 2/3 от празничните
# дни. Той пътува до родния си град h пъти в годината, където играе волейбол със
# старите си приятели в неделя. Влади не е на работа 3/4 от уикендите, в които е в
# София. Отделно, през високосните години Влади играе с 15% повече волейбол от
# нормалното. Приемаме, че годината има точно 48 уикенда, подходящи за
# волейбол. Напишете програма, която изчислява колко пъти Влади е играл
# волейбол през годината. Закръглете резултата надолу до най-близкото цяло
# число (напр. 2.15 -> 2; 9.95 -> 9).
# Входните данни се четат от конзолата:
# • Първият ред съдържа думата “leap” (високосна година) или “normal”
# (нормална година с 365 дни).
# • Вторият ред съдържа цялото число p – брой празници в годината (които не
# са събота или неделя).
# • Третият ред съдържа цялото число h – брой уикенди, в които Влади си
# пътува до родния град.

import math

year_type = input().lower()
holidays = int(input())
weekends_home = int(input())
total_weekends = 48

weekends_in_sofia = total_weekends - weekends_home
weekends_sofia_play = 3 / 4 * weekends_in_sofia
holidays_play = 2/3 * holidays
total_play = weekends_sofia_play + holidays_play + weekends_home

if year_type == "leap":
    total_play *= 1.15

print(math.floor(total_play))
